Revit 2027 API
IFCOpeningDimensions.Area Property
 The area of the opening.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Area { get; set; }
Public Property Area As Double
	Get
	Set
public:
property double Area {
	double get ();
	void set (double value);
}
member Area : float with get, set
Property Value
Double
See Also
Reference
IFCOpeningDimensions Class
Autodesk.Revit.DB.IFC Namespace